{
  "next": {
    "name": "Next JS",
    "description": "O Next.js é um framework poderoso e flexível para construir aplicações React.js. Ele permite que os desenvolvedores criem aplicações prontas para produção com facilidade, oferecendo uma base robusta e uma ampla gama de recursos já prontos para uso.",
    "link": "https://nextjs.org/docs"
  },
  "react": {
    "name": "React JS",
    "description": "React.js: Uma biblioteca dinâmica para construir interfaces de usuário interativas com facilidade, usando componentes declarativos para um desenvolvimento web eficiente.",
    "link": "https://legacy.reactjs.org/docs/getting-started.html"
  },
  "typescript": {
    "name": "TypeScript",
    "description": "TypeScript: Enhances JavaScript with static typing for scalable, maintainable, and error-free web development",
    "link": "https://www.typescriptlang.org/docs/"
  },
  "javascript": {
    "name": "JavaScript",
    "description": "JavaScript: A versatile programming language for web development, enabling dynamic, interactive, and client-side functionality across diverse applications.",
    "link": "https://developer.mozilla.org/en-US/docs/Web/JavaScript"
  },
  "styled-components": {
    "name": "Styled Components",
    "description": "Styled Components: Empowers React developers with CSS-in-JS, enhancing component styling by encapsulating styles within components for robust, maintainable designs",
    "link": "https://styled-components.com/"
  },
  "sass": {
    "name": "SASS",
    "description": "Sass: A powerful CSS preprocessor offering features like variables, nesting, and mixins to streamline stylesheet authoring and enhance maintainability in web projects.",
    "link": "https://sass-lang.com/documentation/"
  },
  "html": {
    "name": "HTML",
    "description": "HTML: The foundation of web development, enabling creation of structured, semantic content for building user interfaces and presenting information across the web.",
    "link": "https://developer.mozilla.org/en-US/docs/Web/HTML"
  },
  "css": {
    "name": "CSS",
    "description": "Cascading Style Sheets, a fundamental technology for web design, enabling customization of layout, typography, and visual presentation to enhance user experience.",
    "link": "https://developer.mozilla.org/en-US/docs/Web/CSS"
  },
  "jest": {
    "name": "Jest",
    "description": "A delightful JavaScript testing framework, providing a simple and intuitive testing experience for ensuring code quality and reliability in projects.",
    "link": "https://jestjs.io/docs/getting-started"
  }
}
