{
  "next": {
    "name": "Next JS",
    "description": "O Next.js é um framework poderoso e flexível para construir aplicações React.js. Ele permite que os desenvolvedores criem aplicações prontas para produção com facilidade, oferecendo uma base robusta e uma ampla gama de recursos já prontos para uso.",
    "link": "https://nextjs.org/docs"
  },
  "react": {
    "name": "React JS",
    "description": "React.js: Uma biblioteca dinâmica para construir interfaces de usuário interativas com facilidade, usando componentes declarativos para um desenvolvimento web eficiente.",
    "link": "https://legacy.reactjs.org/docs/getting-started.html"
  },
  "typescript": {
    "name": "TypeScript",
    "description": "TypeScript: Melhora o JavaScript com tipagem estática para um desenvolvimento web escalável, sustentável e sem erros.",
    "link": "https://www.typescriptlang.org/docs/"
  },
  "javascript": {
    "name": "JavaScript",
    "description": "JavaScript: Uma linguagem de programação versátil para o desenvolvimento web, permitindo funcionalidade dinâmica, interativa e do lado do cliente em diversas aplicações.",
    "link": "https://developer.mozilla.org/en-US/docs/Web/JavaScript"
  },
  "styled-components": {
    "name": "Styled Components",
    "description": "Styled Components: Capacita desenvolvedores React com CSS-in-JS, aprimorando o estilo dos componentes ao encapsular estilos dentro dos componentes para designs robustos e sustentáveis.",
    "link": "https://styled-components.com/"
  },
  "sass": {
    "name": "SASS",
    "description": "Sass: Um poderoso pré-processador CSS que oferece recursos como variáveis, aninhamento e mixins para agilizar a criação de estilos e melhorar a manutenibilidade em projetos web.",
    "link": "https://sass-lang.com/documentation/"
  },
  "html": {
    "name": "HTML",
    "description": "HTML: A base do desenvolvimento web, permitindo a criação de conteúdo estruturado e semântico para construir interfaces de usuário e apresentar informações na web.",
    "link": "https://developer.mozilla.org/en-US/docs/Web/HTML"
  },
  "css": {
    "name": "CSS",
    "description": "Cascading Style Sheets (CSS), uma tecnologia fundamental para o design web, que permite a personalização de layout, tipografia e apresentação visual para aprimorar a experiência do usuário.",
    "link": "https://developer.mozilla.org/en-US/docs/Web/CSS"
  },
  "jest": {
    "name": "Jest",
    "description": "Um encantador framework de testes em JavaScript, que oferece uma experiência de teste simples e intuitiva para garantir a qualidade e a confiabilidade do código em projetos.",
    "link": "https://jestjs.io/docs/getting-started"
  }
}
